import streamlit as st
import pandas as pd
from datetime import date

# Configure the page
st.set_page_config(
   page_title="CM",
   page_icon="📄",
   layout="centered",
   initial_sidebar_state="collapsed",
)


def check_password():
    """Returns `True` if the user had the correct password."""

    def password_entered():
        """Checks whether a password entered by the user is correct."""
        if st.session_state["password"] == st.secrets["passwords"]["test_user"]:
            st.session_state["password_correct"] = True
            del st.session_state["password"]  # don't store password
        else:
            st.session_state["password_correct"] = False

    if "password_correct" not in st.session_state:
        # First run, show input for password.
        st.text_input(
            "Password", type="password", on_change=password_entered, key="password"
        )
        return False
    elif not st.session_state["password_correct"]:
        # Password not correct, show input + error.
        st.text_input(
            "Password", type="password", on_change=password_entered, key="password"
        )
        st.error("😕 Password incorrect")
        return False
    else:
        # Password correct.
        return True

if check_password():

   st.subheader("Формування договору")
   cat_col, type_col = st.columns([1,0.5])
   with cat_col:
      select_cat = st.selectbox(
         "Обрати вид договору", 
         ["Договір на послуги з ремонту тепловозу", 
         "Договір оренди", "Договір надання послуг"]) 
   with type_col:
      select_type = st.radio('', ['Витратний', 'Прибутковий'], horizontal=True)

   st.write("""Існує типовий договір обраного виду""") 

   # User Inputs
   with st.expander("Зазначте необхідні дані для завершення формування договору"):
      if select_cat == "Договір на послуги з ремонту тепловозу":
         in1_col, in2_col = st.columns(2)
         with in1_col:
            input1 = st.selectbox("Обсяг ремонту", ["ПР-1", "ПР-2"])
         with in2_col:
            input2 = st.selectbox("Обсяг ТО", ["ТО-3", "ТО-4"])

         in3_col, in4_col = st.columns(2)
         with in3_col:
            input3 = st.selectbox("Місто укладання договору", 
            ["Київ", "Львів", "Харків", "Дніпро", "Одеса", "Лиман"])
         with in4_col:
            current_date = date.today()
            input4 = st.date_input("Дата укладання договору", min_value=current_date)

         st.caption("Інформація щодо контрагента")
         in5_col, in6_col = st.columns(2)
         with in5_col:
            input5 = st.text_input("Код ЄДРПОУ Контрагента*", '38560924')
            st.caption("*спробуй 38560924 або 40297125")
         with in6_col:
            edr = {'38560924' : { 
               'title' : 'Товариство з обмеженою відповідальністю "Полтавський тепловозоремонтний завод"',
               'rep' : "Василенко Василина Василівна" 
            },
            '40297125' : {
               'title' : 'Товариство з обмеженою відповідальністю "Запорізькій тепловозоремонтний завод"',
               'rep' : 'Петренко Петро Петрович'
            }}
            st.write("")
            input6 = edr.get(input5).get('title')
            input7 = edr.get(input5).get('rep')
            st.caption(input6)
         
         in8_col, in9_col = st.columns(2)
         with in8_col:
            input8 = st.text_input("Номер довіреності")
         with in9_col:
            input9 = st.date_input("Дата видачі довіреності")

         st.caption("Інформація щодо предмету договору")
         in10_col, in11_col = st.columns(2)
         with in10_col:
            input10 = st.text_input("Серія", "ЧМЕЗ")
         with in11_col:
            input11 = st.text_input("Номер", "302")

         in12_col, in13_col = st.columns(2)
         with in12_col:
            input12 = st.number_input("Вартість однієї послуги з ремонту (грн), з ПДВ")
            input122 = st.number_input("Вартість одного ТО (грн)")
         
         with in13_col:
            input13 = st.number_input("Загальна вартість договору (грн), з ПДВ")

         input14 = st.text_input("Призначення платежу")

         st.caption("Приймання в ремон та видача з ремонту")
         in15_col, in16_col = st.columns(2)
         with in15_col:
            input15 = st.text_input("Форма акту приймання", "ТУ-25")
         with in16_col:
            input16 = st.number_input("Номер інструкції", "ЦТ 0057")
         
         


   chapters = [
      "Преамбула", "1. Предмет договору", "2. Вартість послуг і умови розрахунку",
   "3. Умови та місце наданих послуг", "4. Порядок приймання-передачі наданих послуг", 
   "5. Обставини непереборної сили", "6. Відповідальність сторін", 
   "7. Антикорупційне застереження", "8. Порядок вирішення спорів", 
   "9. Застереження про конфіденційність", "10. Інші умови договору",
   "11. Термін дії Договору", "12. Додатки до договору", 
   "13. Юридичні адреси та банківські реквізити Сторін"]

   # Add empty line for better readibility
   st.write("")

   col1, col2, col3 = st.columns(3)
   with col2:
      st.subheader("ДОГОВІР №")
   st.write(f"""на надання послуг з поточного ремонту в обсязі 
   {input1} та технічного обслуговування в обсязі {input2}""")

   col1, col2 = st.columns([1,0.2])
   with col1:
      st.caption(f"м. {input3}")
   with col2:
      st.caption(input4)

   with st.expander("Преамбула"):
      st.caption("""Акціонерне товариство «Українська залізниця», далі – Виконавець, 
      в особі акціонерного товариства «Українська залізниця», з однієї сторони, та""")
      st.caption(f"""{input6}, далі – Замовник, в особі {input7}, яка(ий) діє на підставі 
      довіреності № {input8} від {input9} р., з іншої сторони, при  спільному 
      згадуванні – Сторони, уклали цей Договір про наступне.""")

   with st.expander("1. Предмет договору"):
      st.caption(f"""1.1. Виконавець зобов’язується надати послуги з поточного ремонту 
      в обсязі {input1} та технічного обслуговування в обсязі {input2} тепловоза серії {input10} № {input11} 
      власності Замовника з використанням матеріалів та запасних частин Замовника 
      (далі {input1}, {input2} або послуги), а Замовник провести оплату вартості послуг 
      згідно з умовами цього договору.""")
      st.caption(f"""1.2. За даним договором Виконавець протягом його дії проводить 
      {input1} та {input2} один раз згідно графіка (Додаток 1).""")

   with st.expander("2. Вартість послуг і умови розрахунку"):
      st.caption(f"""2.1. Вартість послуг за договором визначена у Протоколі погодження вартості 
      послуг (Додаток № 2), який є невід’ємною частиною даного Договору.""")
      st.caption(f"""2.2. Загальна вартість договору складає {input13} грн.  
      в т.ч. ПДВ 20% - {input13*0.20} грн.""")
      st.caption(f"""2.3. Вартість однієї послуги з проведення {input1} становить,
      {input12} грн, в т.ч. ПДВ 20% – {input12*0.20} грн.""")
      st.caption(f"Вартість однієї послуги з проведення {input2} становить {input122} грн.")
      st.caption("""2.4. Замовник здійснює 100% попередню оплату вартості послуги на поточний 
      рахунок Виконавця на підставі виставленого рахунку, з урахування об’ємів послуг які будуть надаватись.""")
      st.caption(f"""2.5. При здійсненні оплати в графі призначення платежу необхідно проставляти числовий номер {input14}""")
      st.caption("""2.6. Вартість послуг, які не передбачені даним договором, визначається додатково та оформляється 
      і погоджується представниками Сторін з оформленням додаткових угод до даного договору або інших договорів.""")
      st.caption("""2.7. У разі збільшення розміру заробітної плати та зміни інших ціноутворюючих факторів, фактичного 
      показника індексу цін виробника промислової продукції, вартість послуг за цим договором буде змінюватись шляхом 
      укладення додаткових угод до договору.""")
      st.caption("""2.8. Запасні частини, вузли, паливо-мастильні та інші матеріали, необхідні для надання послуг надає Замовник.""")
      st.caption(f"""2.9. Всі витрати пов’язані з доставкою тепловоза до місця надання послуг для проведення 
      {input2} або {input1} та у зворотному напрямку, в тому числі витрати по сплаті вартості залізничного тарифу несе Замовник.""")
      

   with st.expander("3. Умови та місце наданих послуг"):
      st.caption("""3.1. Місцем надання послуг є територія Виконавця:""")
      st.caption("""3.2. Подача тепловоза здійснюється в ремонтопридатному стані. 
      Тепловоз повинен бути укомплектований усіма вузлами та деталями, передбаченими конструкторською документацією.""")
      st.caption("""3.3 Термін надання однієї послуги складає не більше п’яти робочих діб з моменту постановки тепловоза на 
      стійло та здійснення попередньої оплати у відповідності до п. 2.4 даного договору.""")
      st.caption("""Термін надання послуги може бути збільшений при необхідності надання додаткових послуг 
      на термін їх надання, а також відсутність запасних частин, вузлів, паливо-мастильних та інші матеріалів, 
      необхідних для надання послуг.""")
      st.caption(f"""3.2. Додаткові послуг, які не входять в перелік планових видів робіт {input1} та/або {input2} та 
      непередбачені даним договором, надаються додатково та оформляються і погоджуються представниками Сторін. 
      Перелік додаткових послуг оформляється актом за підписом уповноважених представників Сторін на підставі 
      якого укладається додаткова угода до договору.""")
      st.caption(f"""3.3. Виконавець проводить приймання тепловоза в ремонт та видачу з ремонту при наявності 
      у Замовника акту встановленої форми {input15} оформленого згідно інструкції {input16} та оформлених перевізних документів.""")
      st.caption("""3.4. Замовник має право направляти своїх представників в процесі надання послуг для контролю якості 
      та повноти обсягів надання послуг. Такі перевірки здійснюються з ініціативи Замовника із залученням 
      відповідних фахівців за відома Виконавця.""")
      st.caption("""3.5. Замовник зобов’язується прийняти тепловоз після надання Виконавцем послуг.""")

   with st.expander("4. Порядок приймання-передачі наданих послуг"):
      art4 = """4.1. Приймання наданих послуг здійснюється Замовником з обов’язковим складанням відповідного 
      Акту приймання-передачі наданих послуг, який підписується повноважними представниками Сторін, протягом 5 (п’яти) 
      робочих днів з дати надання послуг.
      4.2. Уповноваженими зі сторони Виконавця, які підписуватимуть Акт приймання-передачі наданих послуг є особи, 
      що діють на підставі відповідних довіреностей: начальник служби локомотивного господарства регіональної філії, 
      заступник начальника служби локомотивного господарства регіональної філії, головний інженер служби локомотивного 
      господарства регіональної філії, начальник виробничого структурного підрозділу регіональної філії (особа, що виконує 
      його обов’язки), в інтересах якого укладено Договір.
      4.3. Акт приймання-передачі наданих послуг складається у двох примірниках. Один примірник після підписання 
      Замовником повертається Виконавцю."""
      st.caption(art4)
   
   for chapter in chapters[4:]:
      with st.expander(chapter):
         st.write("Some text")
